# Задание №1
a = 5
b = 10
g = int(input("Введите число"))

c = (a + b) * g

print( a, b, g, c)

