# Задание №3

n = int(input("Введите число"))
n1 = n*11
n2 = n*111
sum = n+ n1+n2
print( sum)

#можно также через строку
a = int(input("Введите число #2 "))
value = str(a)
a1 = value  + value
a2 = value  + value  + value
sum_a = a + int(a1) + int(a2)
print("Результат:", sum_a)